### SQL Overview

#### Selecting Rows

In [2]:
import pandas as pd 
import sqlite3

```SQL

-- world.db

SELECT 'Hello, World';

SELECT 'Hello, World' AS Result;

SELECT * FROM Country;

SELECT * FROM Country ORDER BY Name;

SELECT Name, LifeExpectancy FROM Country ORDER BY Name;

SELECT Name, LifeExpectancy AS "Life Expectancy" FROM Country ORDER BY Name;

SELECT Name, Continent, Region FROM Country;
SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe';
SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name;
SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name LIMIT 5;
SELECT Name, Continent, Region FROM Country WHERE Continent = 'Europe' ORDER BY Name LIMIT 5 OFFSET 5;

```

#### Selecting Columns

```SQL
-- world.db

SELECT * from Country;

SELECT Name, Continent, Region 
from Country;

SELECT Name AS Country, Continent, Region 
from Country;

SELECT Name AS Country, Region, Continent 
from Country;

```

#### Counting Rows

```SQL
-- world.db

SELECT COUNT(*) 
FROM Country;

SELECT COUNT(*) 
FROM Country 
WHERE Population > 1000000;

SELECT COUNT(*) 
FROM Country 
WHERE Population > 100000000;

SELECT COUNT(*) 
FROM Country 
WHERE Population > 100000000 AND Continent = 'Europe' ;

SELECT COUNT(*) 
FROM Country;

SELECT COUNT(LifeExpectancy) 
FROM Country;
```

#### 08 Updating Data

```SQL
-- test.db

SELECT * FROM customer;
UPDATE customer SET address = '123 Music Avenue', zip = '98056' WHERE id = 5;
UPDATE customer SET address = '2603 S Washington St', zip = '98056' WHERE id = 5;
UPDATE customer SET address = NULL, zip = NULL WHERE id = 5;
```

In [7]:
con = sqlite3.connect("data/test.db")
pd.read_sql_query("SELECT * FROM customer", con)

   id            name              address     city state    zip
0   1      Bill Smith      123 Main Street     Hope    CA  98765
1   2      Mary Smith    123 Dorian Street  Harmony    AZ  98765
2   3       Bob Smith     123 Laugh Street    Humor    CA  98765
3   6    Jimi Hendrix                 None   Renton    WA   None
4   7  Fred Flinstone  123 Cobblestone Way  Bedrock    CA  92134
5   8    Jimi Hendrix                 None   Renton    WA   None

#### Deleting Data

```SQL
-- test.db

SELECT * FROM customer WHERE id = 4;
DELETE FROM customer WHERE id = 4;
SELECT * FROM customer;
DELETE FROM customer WHERE id = 5;
SELECT * FROM customer;
```

In [9]:
con = sqlite3.connect("data/test.db")
pd.read_sql_query("SELECT * FROM customer WHERE id = 1", con)

   id        name          address  city state    zip
0   1  Bill Smith  123 Main Street  Hope    CA  98765